DeviceProcessEvents
| where InitiatingProcessFileName has "bash"
| where FolderPath has "/usr/bin/curl"
| where FileName has "install.sh" or FileName endswith ".sh"
//| where ProcessCommandLine has_all (@"-o ", @"/tmp/", @">/dev/null") //more generic
| where ProcessCommandLine has_all (@"/getrur/update", @"-o ", @"/tmp/update", @">/dev/null")
//| summarize count() by FileName, InitiatingProcessFileName, InitiatingProcessCommandLine, FolderPath, ProcessCommandLine
//Description:
//Password Harvesting:
//Gets Current User: username=$(whoami)
//Password Prompt Loop: Continuously prompts "System Password:" until correct password entered
//Password Validation: Uses dscl . -authonly to verify the password against macOS directory services
//Password Storage: Saves the valid password to /tmp/.pass file
//Reference(s):["https://www.cloudsek.com/blog/amos-variant-distributed-via-clickfix-in-spectrum-themed-dynamic-delivery-campaign-by-russian-speaking-hackers"]
